import { IPeriod } from "../types/HistoricalDates/HistoricalPeriods"

export const historicalPeriods: IPeriod[] = [
  {
    topic: "Физика",
    from: 1905,
    to: 1954,
    events: [
      {
        year: 1905,
        description:
          "В 1905 году Альберт Эйнштейн представил свою теорию относительности, которая изменила наше представление о времени, пространстве и массе",
      },
      {
        year: 1913,
        description:
          "В 1913 году Нильс Бор предложил модель атома, основанную на квантовой механике, где электроны движутся по круговым орбитам вокруг ядра",
      },
      {
        year: 1927,
        description:
          "Вернер Гейзенберг сформулировал принцип неопределённости, утверждающий, что невозможно одновременно точно измерить положение и импульс частицы",
      },
      {
        year: 1938,
        description:
          "Отто Ган и Фриц Штрауссманн обнаружили ядерное деление урана, что стало основой для развития атомной энергии и создания ядерного оружия",
      },
      {
        year: 1947,
        description:
          "В 1947 году Джон Бардин, Уильям Шокли и Уолтер Брэттейн создали первый транзистор, что привело к революции в электронике и компьютерных технологиях",
      },
      {
        year: 1954,
        description:
          "Джеральд Пирсон, Калвин Фуллер и Дарлин Чапин разработали первые солнечные элементы, открыв путь к использованию солнечной энергии в промышленности",
      },
    ],
  },
  {
    topic: "Медицина",
    from: 1964,
    to: 1982,
    events: [
      {
        year: 1964,
        description: "Первая вакцина против кори",
      },
      {
        year: 1965,
        description:
          "Франк Пантридж устанавливает первый портативный дефибриллятор",
      },
      {
        year: 1967,
        description:
          "Кристиан Барнард произвёл первую трансплантацию сердца человеку",
      },
      {
        year: 1970,
        description: "Последний смертный случай от натуральной оспы",
      },
      {
        year: 1980,
        description:
          "Реймонд Дамадьян построил первый коммерческий магнитно-резонансный томограф",
      },
      {
        year: 1982,
        description:
          "Искусственное сердце: Роберт Джарвик (разработка и имплантация практичной модификации Jarvic-7 на базе опытных образцов)",
      },
    ],
  },
  {
    topic: "Информатика",
    from: 1983,
    to: 1995,
    events: [
      {
        year: 1983,
        description:
          "ARPANET, предшественник интернета, перешел на использование протокола TCP/IP в 1983 году, что стало ключевым шагом к созданию современного интернета",
      },
      {
        year: 1984,
        description:
          "Компания Apple выпустила первый Macintosh компьютер, который стал одним из первых персональных компьютеров с графическим пользовательским интерфейсом",
      },
      {
        year: 1989,
        description:
          "Тим Бернерс-Ли разработал World Wide Web (WWW), что привело к возникновению интернета в виде глобальной сети документов, связанных гиперссылками",
      },
      {
        year: 1991,
        description:
          "Линус Торвальдс выпустил первую версию операционной системы Linux, которая стала популярной альтернативой коммерческим ОС",
      },
      {
        year: 1993,
        description:
          "Марк Андрессен и Эрик Бина создали веб-браузер Mosaic, который стал первым широко используемым браузером для просмотра веб-страниц",
      },
      {
        year: 1995,
        description:
          "Компания Sun Microsystems выпустила язык программирования Java, который стал популярным благодаря своей платформенной независимости и простоте использования",
      },
    ],
  },
  {
    topic: "Биология",
    from: 1996,
    to: 2005,
    events: [
      {
        year: 1996,
        description:
          "Была обнаружена первая экзопланета, вращающаяся вокруг двойной звезды PSR B1620-26, что расширило наше понимание о разнообразии планетарных систем",
      },
      {
        year: 1997,
        description:
          "Астрономы обнаружили гигантское кольцо вокруг планеты Юпитер, что стало первым подобным открытием в Солнечной системе",
      },
      {
        year: 1998,
        description:
          "Было объявлено об открытии темной энергии, что изменило наше представление о расширении Вселенной и её структуре",
      },
      {
        year: 2002,
        description:
          "Астрономы обнаружили космические лучи высоких энергий, что помогло лучше понять происхождение и природу этих частиц",
      },
      {
        year: 2003,
        description:
          "Астрономы обнаружили первый атмосферный слой на экзопланете, что помогло понять состав и структуру атмосфер планет за пределами нашей Солнечной системы",
      },
      {
        year: 2005,
        description:
          "Были открыты первые карликовые планеты в Кайперовом поясе, что привело к расширению нашего знания о малых объектах во Вселенной",
      },
    ],
  },
  {
    topic: "Химия",
    from: 2006,
    to: 2015,
    events: [
      {
        year: 2006,
        description:
          "Английскими учеными был открыт графен — двумерный материал из углерода, обладающий уникальными свойствами, такими как высокая прочность и электропроводность",
      },
      {
        year: 2007,
        description:
          "Исследователи объявили о создании первого искусственного живого организма, что открыло новые перспективы для синтетической биологии",
      },
      {
        year: 2008,
        description:
          "Было подтверждено открытие нового химического элемента — фермия, который является тяжелым трансурановым элементом",
      },
      {
        year: 2010,
        description:
          "Были разработаны квантовые точки — наночастицы полупроводников, которые нашли применение в электронике и медицине",
      },
      {
        year: 2013,
        description:
          "Были обнаружены первые криптоновые соединения, что противоречило ранее принятой концепции о химических свойствах криптона",
      },
      {
        year: 2015,
        description:
          "Была обнаружена новая форма углерода — фуллереновые нити, которые обладают уникальными механическими и электронными свойствами",
      },
    ],
  },
  {
    topic: "Искуственный интеллект",
    from: 2016,
    to: 2021,
    events: [
      {
        year: 2016,
        description:
          "AlphaGo, разработанный компанией DeepMind, победил чемпиона мира по игре Го, демонстрируя превосходство искусственного интеллекта в сложных стратегических играх",
      },
      {
        year: 2017,
        description:
          "Исследования в области глубокого обучения привели к улучшению систем обработки естественного языка, что повлекло за собой создание более точных и интуитивных моделей",
      },
      {
        year: 2018,
        description:
          "Была представлена модель GPT, которая стала одной из первых успешных моделей на основе трансформеров для генерации текста",
      },
      {
        year: 2019,
        description:
          "Компании начали активное тестирование и внедрение технологий искусственного интеллекта для развития автономных транспортных средств, что открыло новые перспективы для будущего транспорта",
      },
      {
        year: 2020,
        description:
          "Исследователи начали использовать методы искусственного интеллекта для анализа данных о COVID-19, помогая в прогнозировании распространения вируса и разработке лекарств",
      },
      {
        year: 2022,
        description:
          "Была представлена модель DALL-E, способная генерировать уникальные изображения на основе текстовых описаний, открывая новые возможности в области синтеза контента",
      },
    ],
  },
]
